project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/expensive_canceled_1s/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                        !   0.00%INFO: 2023/06/12 14:42:40 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 14:42:40 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 14:42:40 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.2702 secs.
  Slowest:	0.0649 secs.
  Fastest:	0.0002 secs.
  Average:	0.0009 secs.
  Stddev:	0.0040 secs.
  Requests/sec:	97.3691

Response time histogram:
  0.0002 [1]	|
  0.0067 [989]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0131 [1]	|
  0.0196 [0]	|
  0.0261 [0]	|
  0.0326 [4]	|
  0.0390 [1]	|
  0.0455 [1]	|
  0.0520 [1]	|
  0.0585 [1]	|
  0.0649 [1]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0003 secs.
  50% in 0.0004 secs.
  75% in 0.0006 secs.
  90% in 0.0008 secs.
  95% in 0.0011 secs.
  99% in 0.0070 secs.
  99.9% in 0.0649 secs.